// Lab1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <stdio.h>
int main()
{
    float dsp = 0.6;//средняя плотность в г/см3
    float dvp = 0.9;//тяжелая, подходит для мебели в г/см3
    int h, w, d;
    scanf_s("%i %i %i", &h, &w, &d);
    
    float zadst = dvp * h * w * 0.5;
    float bok = 2 * dsp * h * d * 1.5;
    float veini = 2 * w * d * 0.1;
    float dver = dvp * h * w * 1;
    //пусть h внутренней полки = 1см
    float pol;
    if (h < 205) {
        pol = 4 * w * d * dsp;
    }
    else {
        pol = 5 * w * d * dsp;
    }
    float sum = zadst + bok + veini + dver + pol;
    printf("%f", sum);
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
